# Префиксы комманд:
commands_prefix = ['!', '.', '-', '/']
# Команды для спама:
spam_command = ['спам', 'spam']
# Команды для проверки пинга:
ping_command = ['пинг', 'ping']
# Команды для анимации с сердцем:
love_command = ['love', 'hearts']
# Команды для курса доллара
dollar_command = ['dollar', 'курс']
# Команда для помощи
help_command = ['help', 'помощь']
# Команда для оскорбления
bulling_command = ['bulling', 'булинг']
# Команда комплименты
compli_command = ['compli', 'комплименты']
# Команда спокойной ночи
night_command = ['night', 'ночь']
# Команда любовь
loves_command = ['loves', 'любовь']
# Команда Like
like_command = ['like', 'лайк']
# Команда dislike
dislike_command = ['dislike', 'дизлайк']
# Команда profile
profile_command = ['profile', 'профиль']
# Команда kill
kill_command = ['kill', 'убить']
# Команда type
type_command = ["type", "!type", "-type", ".type"]
# Команда drugs
drugs_command = ['drugs', 'наркота']
# Команда football
football_command = ['football', 'футбол']
# Команда random
random_command = ['random', 'рандом']
# Команда timer
timer_command = ['timer', 'таймер']
# Команда calc
calc_command = ['calc', 'калькулятор']
# Команда translate
translate_command = ['translate', 'переведи']
# Команда timer
weather_command = ['weather', 'погода']
# Команда ipcheck
ipcheck_command = ['ipcheck', 'айпи']
# Команда resolve
resolve_command = ['resolve', 'резолв']
# Команда dictionary
dictionary_command = ['dictionary', 'словарь']
# Команда write
write_command = ['write', 'запись']
# Команда python
python_command = ['python', 'питон']
# Команда relationship
relationship_command = ['relationship', 'отношения']
# Команда time
information_command = ['information', 'информация']
# Команда phone
phone_command = ['phone', 'телефон']
# Команда xyu
xyu_command = ['xuy', 'хуй']
# Команда mother
mother_command = ['mother', 'мама']
# Команда settings
message_command = ['message', 'сообщение']
# Команда hug
hug_command = ['hug', 'обнять']
# Команда kiss
kiss_command = ['kiss', 'поцеловать']
# Команда hit
hit_command = ['hit', 'ударить']
# Команда bite
bite_command = ['bite', 'укусить']
# Команда gay
gay_command = ['gay', 'гей']
# Команда penis
penis_command = ['penis', 'член']
# Команда article
article_command = ['article', 'закон']
# Команда dice
dice_command = ['dice', 'дайс']
# Команда loved
loved_command = ['loved', 'ловед']
# Команда lovestory
lovestory_command = ['lovestory', 'любовнаяистория']
# Команда escape
escape_command = ['escape', 'побег']
# Команда crypto
crypto_command = ['crypto', 'крипта']

# Коды цветов ANSI:
RESET = "\x1b[m"
BLACK = "\x1b[38;5;16m"
DARK_BLUE = "\x1b[38;5;19m"
DARK_GREEN = "\x1b[38;5;34m"
DARK_AQUA = "\x1b[38;5;37m"
DARK_RED = "\x1b[38;5;124m"
PURPLE = "\x1b[38;5;127m"
GOLD = "\x1b[38;5;214m"
GRAY = "\x1b[38;5;145m";
DARK_GRAY = "\x1b[38;5;59m"
BLUE = "\x1b[38;5;63m"
GREEN = "\x1b[38;5;83m"
AQUA = "\x1b[38;5;87m"
RED = "\x1b[38;5;203m"
LIGHT_PURPLE = "\x1b[38;5;207m"
YELLOW = "\x1b[38;5;227m"
WHITE = "\x1b[38;5;231m"


# Слова
comp = '''
<b>Крошечные напоминания того, что ты...</b> 
<b>Самая удивительная</b> ✨
<b>Самая внимательная</b> ✨
<b>Самая красивая</b> ✨
<b>Самая успешная</b> ✨
<b>Самая заботливая</b> ✨
<b>Самая милая</b> ✨
<b>Самая прекрасная</b> ✨
<b>Самая умная</b> ✨
<b>Самая шикарная</b> ✨
<b>Самая обалденная ✨</b>
<b>Самая очаровашка</b> ✨
<b>Самая любимая</b> ✨
<b>Самая весёлая</b> ✨
<b>Самая нежная</b> ✨
<b>Самая яркая</b> ✨
<b>Самая прелестная</b> ✨
<b>Самая приятная</b> ✨
<b>Самая сладкая</b> ✨
<b>Самая дивная</b> ✨
<b>Самая ангельская</b> ✨
<b>Самая добрая</b> ✨
<b>Самая бесподобная</b> ✨
<b>Самая волшебная</b> ✨
<b>Самая лучшая</b> ✨
<b>Самая крутышка</b> ✨
<b>Самая аромтная</b> ✨
<b>Самая единственная</b> ✨
<b>Самая искренняя</b> ✨
<b>Самая ласковая</b> ✨
<b>Самая романтичная</b> ✨
<b>Самая великолепная</b> ✨
<b>Самая внимательная</b> ✨
<b>Самая страстная</b> ✨
<b>Самая игривая</b> ✨
<b>Самая стройная</b> ✨
<b>Самая безумная</b> ✨
<b>Самая симпатичная</b> ✨
<b>Самая изящная </b> ✨
<b>Самая талантливая ✨</b>
<b>Самая элегантная ✨</b>
<b>Самая чуткая ✨</b>
<b>Самая отзывчивая ✨</b>
<b>Самая уникальная ✨</b>
<b>Самая смелая ✨</b>
<b>Самая уверенная ✨</b>
<b>Самая особенная ✨</b>
<b>Самая изумительная ✨</b>
<b>Самая настоящая ✨</b>
<b>Самая обаятельная ✨</b>
<b>Самая пушистая ✨</b>
<b>Самая кокетливая ✨</b>
<b>Самая теплая ✨</b>
<b>Самая энергичная ✨</b>
<b>Самая неотразимая ✨</b>
<b>Самая неописуемая ✨</b>
<b>Самая грациозная ✨</b>
<b>Самая сказочная ✨</b>
<b>Самая желанная ✨</b>
<b>Самая изысканная ✨</b>
<b>Самая мечтательная ✨</b>
<b>Самая безупречная ✨</b>
<b>Самая совершеная ✨</b>
<b>Самая честная ✨</b>
<b>Самая улыбчивая ✨</b>
<b>Самая ненаглядная ✨</b>
<b>Самая женственная ✨</b>
<b>Самая цветущая ✨</b>
<b>Самая гармоничная ✨</b>
<b>Самая отрадная ✨</b>
'''

night = '''
<b>спокойной ночи зайка 💚</b>
<b>спокойной ночи солнышко 💛</b>
<b>спокойной ночи котёнок ❤</b>️
<b>спокойной ночи цветочек 💙</b>
<b>спокойной ночи ангелочек 💜</b>
<b>спокойной ночи принцесса 💓</b>
<b>спокойной ночи красотка 💕</b>
<b>спокойной ночи милашка 💖</b>
<b>спокойной ночи симпатяжка 💗</b>
<b>спокойной ночи бусинка 💘</b>
<b>❤я❤</b>️
<b>💚 тебя 💚</b>
<b>💙 очень 💙</b>
<b>💛 сильно 💛</b>
<b>💜 люблю 💜</b>
'''